alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F123_vs_cmd0_mem_0.c
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 14                                                                      */
/* out_xy_comp 30                                                                   */
/* input0_select 30                                                                 */
/* out_zw_comp 30                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/* Register 15                                                                      */
/* out_xy_comp 31                                                                   */
/* input0_select 31                                                                 */
/* out_zw_comp 31                                                                   */
/* Adder0                                                                           */
/* adder0_in0 0                                                                     */
/* adder0_in1 22                                                                    */
/* out_x_select 0                                                                   */
/* Adder1                                                                           */
/* adder1_in0 1                                                                     */
/* adder1_in1 22                                                                    */
/* out_y_select 1                                                                   */
/* Mult0                                                                            */
/* mult0_in0 2                                                                      */
/* mult0_in1 22                                                                     */
/* out_z_select 2                                                                   */
/* Mult1                                                                            */
/* mult1_in0 3                                                                      */
/* mult1_in1 22                                                                     */
/* out_w_select 3                                                                   */
/*  call address                                                                    */
/*  load multiple registers (0-63) from address 0x40                                */
/*  start shader.                                                                   */
/*  flush                                                                           */
/*  load shader from address 0x400                                                  */
/*  set number of output registers                                                  */
/*  Set a single configuration register                                             */
/*  Start shader                                                                    */
/*  Streams for run 0.                                                              */
/*  Streams for run 1.                                                              */
/* unsigned int data_00000000[1024] = */ 
{
  0x000000c0, 0x70000000, 0x00000210, 0x20400000 /* 0x0; */
, 0x01000001, 0x00000000, 0x00000000, 0x60000000 /* 0x10; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x20; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x30; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x40; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x50; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x60; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x70; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x80; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x90; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0xa0; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0xb0; */
, 0x00000400, 0x40100000, 0x0f000f33, 0x10000042 /* 0xc0; */
, 0x00f03c00, 0x10000040, 0x00000110, 0x20400000 /* 0xd0; */
, 0x01000001, 0x00000000, 0x00000000, 0x60000000 /* 0xe0; */
, 0x00000000, 0x80000000, 0x00000000, 0x00000000 /* 0xf0; */
, 0x00000000, 0x00000000, 0x00000000, 0x00000000 /* 0x100; */
, 0x00001200, 0x00100003, 0x00001210, 0x00100003 /* 0x110; */
, 0x00001220, 0x00100003, 0x00001230, 0x00100003 /* 0x120; */
, 0x00001240, 0x00100003, 0x00001250, 0x00100003 /* 0x130; */
, 0x00001260, 0x00100003, 0x00001270, 0x00100003 /* 0x140; */
, 0x00001280, 0x00100003, 0x00001290, 0x00100003 /* 0x150; */
, 0x000012a0, 0x00100003, 0x000012b0, 0x00100003 /* 0x160; */
, 0x000012c0, 0x00100003, 0x000012d0, 0x00100003 /* 0x170; */
, 0x000012e0, 0x00100003, 0x000012f0, 0x00100003 /* 0x180; */
, 0x00002000, 0x0010000f, 0x00002008, 0x0010000f /* 0x190; */
, 0x00002010, 0x0001000f, 0x00002018, 0x0001000f /* 0x1a0; */
, 0x00002020, 0x0001000f, 0x00002028, 0x0001000f /* 0x1b0; */
, 0x00002030, 0x0001000f, 0x00002038, 0x0001000f /* 0x1c0; */
, 0x00002040, 0x0001000f, 0x00002048, 0x0001000f /* 0x1d0; */
, 0x00002050, 0x0001000f, 0x00002058, 0x0001000f /* 0x1e0; */
, 0x00002060, 0x0001000f, 0x00002068, 0x0001000f /* 0x1f0; */
, 0x00002070, 0x0001000f, 0x00002078, 0x0001000f /* 0x200; */
, 0x00003200, 0x00100003, 0x00003210, 0x00100003 /* 0x210; */
, 0x00003220, 0x00100003, 0x00003230, 0x00100003 /* 0x220; */
, 0x00003240, 0x00100003, 0x00003250, 0x00100003 /* 0x230; */
, 0x00003260, 0x00100003, 0x00003270, 0x00100003 /* 0x240; */
, 0x00003280, 0x00100003, 0x00003290, 0x00100003 /* 0x250; */
, 0x000032a0, 0x00100003, 0x000032b0, 0x00100003 /* 0x260; */
, 0x000032c0, 0x00100003, 0x000032d0, 0x00100003 /* 0x270; */
, 0x000032e0, 0x00100003, 0x000032f0, 0x00100003 /* 0x280; */
, 0x00004000, 0x00100007, 0x00004010, 0x00100007 /* 0x290; */
, 0x00004020, 0x00010007, 0x00004030, 0x00010007 /* 0x2a0; */
, 0x00004040, 0x00010007, 0x00004050, 0x00010007 /* 0x2b0; */
, 0x00004060, 0x00010007, 0x00004070, 0x00010007 /* 0x2c0; */
, 0x00004080, 0x00010007, 0x00004090, 0x00010007 /* 0x2d0; */
, 0x000040a0, 0x00010007, 0x000040b0, 0x00010007 /* 0x2e0; */
, 0x000040c0, 0x00010007, 0x000040d0, 0x00010007 /* 0x2f0; */
, 0x000040e0, 0x00010007, 0x000040f0, 0x00010007 /* 0x300; */
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0xb00b0ec2, 0x400002c1, 0x40034400, 0x00001c08 /* 0x400; */
, 0xb00b0ec2, 0x440002c1, 0xc4034400, 0x00001c08 /* 0x410; */
, 0xb00b0ec2, 0x480002c1, 0x48034400, 0x00001c09 /* 0x420; */
, 0xb00b0ec2, 0x4c0002c1, 0xcc034400, 0x00001c09 /* 0x430; */
, 0xb00b0ec2, 0x500002c1, 0x50034400, 0x00001c0a /* 0x440; */
, 0xb00b0ec2, 0x540002c1, 0xd4034400, 0x00001c0a /* 0x450; */
, 0xb00b0ec2, 0x580002c1, 0x58034400, 0x00001c0b /* 0x460; */
, 0xb00b0ec2, 0x5c0002c1, 0xdc034400, 0x00001c0b /* 0x470; */
, 0xb00b0ec2, 0x600002c1, 0x60034400, 0x00001c0c /* 0x480; */
, 0xb00b0ec2, 0x640002c1, 0xe4034400, 0x00001c0c /* 0x490; */
, 0xb00b0ec2, 0x680002c1, 0x68034400, 0x00001c0d /* 0x4a0; */
, 0xb00b0ec2, 0x6c0002c1, 0xec034400, 0x00001c0d /* 0x4b0; */
, 0xb00b0ec2, 0x700002c1, 0x70034400, 0x00001c0e /* 0x4c0; */
, 0xb00b0ec2, 0x740002c1, 0xf4034400, 0x00001c0e /* 0x4d0; */
, 0xb00b0ec2, 0x780002c1, 0x78034400, 0x00001c0f /* 0x4e0; */
, 0xb00b0ec2, 0x7c0002c1, 0xfc034400, 0x00001c0f /* 0x4f0; */
},

/* ###################
 * START OF NEW MEMPAGE: 1 */
/* unsigned int data_00001000[1024] = */ 
{
  0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x44fa0000, 0x447a0000, 0x457a0000, 0x453b8000 /* 0x1200; */
, 0x43480000, 0x42c80000, 0x43c80000, 0x43960000 /* 0x1210; */
, 0x41a00000, 0x41200000, 0x42200000, 0x41f00000 /* 0x1220; */
, 0x40000000, 0x3f800000, 0x40800000, 0x40400000 /* 0x1230; */
, 0x3e4cc000, 0x3dccc000, 0x3eccc000, 0x3e998000 /* 0x1240; */
, 0x3ca3c000, 0x3c23c000, 0x3d23c000, 0x3cf5c000 /* 0x1250; */
, 0x3b030000, 0x3a830000, 0x3b830000, 0x3b448000 /* 0x1260; */
, 0x3951a000, 0x38d1a000, 0x39d1a000, 0x399d4000 /* 0x1270; */
, 0xc4fa0000, 0xc47a0000, 0xc57a0000, 0xc53b8000 /* 0x1280; */
, 0xc3480000, 0xc2c80000, 0xc3c80000, 0xc3960000 /* 0x1290; */
, 0xc1a00000, 0xc1200000, 0xc2200000, 0xc1f00000 /* 0x12a0; */
, 0xc0000000, 0xbf800000, 0xc0800000, 0xc0400000 /* 0x12b0; */
, 0xbe4cc000, 0xbdccc000, 0xbeccc000, 0xbe998000 /* 0x12c0; */
, 0xbca3c000, 0xbc23c000, 0xbd23c000, 0xbcf5c000 /* 0x12d0; */
, 0xbb030000, 0xba830000, 0xbb830000, 0xbb448000 /* 0x12e0; */
, 0xb951a000, 0xb8d1a000, 0xb9d1a000, 0xb99d4000 /* 0x12f0; */
},

/* ###################
 * START OF NEW MEMPAGE: 2 */
/* EMPTY PAGE */ 
/* unsigned int data_00002000[1024]; */ 
{0},

/* ###################
 * START OF NEW MEMPAGE: 3 */
/* unsigned int data_00003000[1024] = */ 
{
  0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x00000000, 0x3f800000, 0x40000000, 0x40400000 /* 0x3200; */
, 0x40800000, 0x40a00000, 0x40c00000, 0x40e00000 /* 0x3210; */
, 0x41000000, 0x41100000, 0x41200000, 0x41300000 /* 0x3220; */
, 0x41400000, 0x41500000, 0x41600000, 0x41700000 /* 0x3230; */
, 0x41800000, 0x41880000, 0x41900000, 0x41980000 /* 0x3240; */
, 0x41a00000, 0x41a80000, 0x41b00000, 0x41b80000 /* 0x3250; */
, 0x41c00000, 0x41c80000, 0x41d00000, 0x41d80000 /* 0x3260; */
, 0x41e00000, 0x41e80000, 0x41f80000, 0x41f80000 /* 0x3270; */
, 0x00000000, 0xbf800000, 0xc0000000, 0xc0400000 /* 0x3280; */
, 0xc0800000, 0xc0a00000, 0xc0c00000, 0xc0e00000 /* 0x3290; */
, 0xc1000000, 0xc1100000, 0xc1200000, 0xc1300000 /* 0x32a0; */
, 0xc1400000, 0xc1500000, 0xc1600000, 0xc1700000 /* 0x32b0; */
, 0xc1800000, 0xc1880000, 0xc1900000, 0xc1980000 /* 0x32c0; */
, 0xc1a00000, 0xc1a80000, 0xc1b00000, 0xc1b80000 /* 0x32d0; */
, 0xc1c00000, 0xc1c80000, 0xc1d00000, 0xc1d80000 /* 0x32e0; */
, 0xc1e00000, 0xc1e80000, 0xc1f80000, 0xc1f80000 /* 0x32f0; */
},

/* ###################
 * START OF NEW MEMPAGE: 4 */
/* EMPTY PAGE */ 
/* unsigned int data_00004000[1024]; */ 
{0},

};
